{
  "course": "Финансы и бизнес для IT-предпринимателя (РК)",
  "lastLesson": 42,
  "lessons": [
    {
      "id": 1,
      "block": "Финансы",
      "title": "Куда уходят деньги: бюджет",
      "status": "completed",
      "note": "Урок проведён ранее. Содержимое не дублируется."
    },
    {
      "id": 2,
      "block": "Лидерство",
      "title": "Почему люди не следуют за тобой",
      "theme": "Урок #2 — БЛОК 2: Лидерство. Почему люди не следуют за тобой.",
      "theory": "Есть три типа авторитета, на которых держится лидерство:\n\n1. **Авторитет должности** — «я начальник, ты подчинённый». Самый слабый. В IT-среде почти не работает — разработчики уходят от таких за неделю.\n\n2. **Авторитет экспертизы** — «он реально шарит». Работает хорошо, особенно в начале. Если ты лучший технарь в команде, люди слушают. Но у него есть потолок: когда команда растёт, ты не можешь быть экспертом во всём.\n\n3. **Авторитет доверия** — «с ним надёжно, он не кинет». Самый сильный и самый долгий в построении. Строится через: а) выполнение обещаний, б) прозрачность в деньгах и решениях, в) умение признавать свои ошибки.\n\nВ РК и СНГ есть культурный баг: многие путают лидерство с контролем. «Я плачу — значит я главный, делай как я сказал». В айтишке это катастрофа. Толковые люди просто молча уходят на фриланс, где им никто не указывает.\n\nЕщё одна ловушка — «лидерство через дружбу». Берёшь друга в команду, стесняешься давать обратную связь, терпишь плохую работу. Через полгода — потерял и проект, и друга.\n\nНастоящий лидер в IT — это тот, кто: ставит понятные задачи, даёт контекст (зачем это делаем), не дёргает каждый час, защищает команду от внешнего хаоса.",
      "case": "Аскар из Алматы — фронтенд-разработчик, собрал команду из 4 человек делать SaaS-продукт для логистики. Первые 3 месяца — всё горело: он сам ревьюил каждый PR, сам общался с клиентами, сам решал конфликты между дизайнером и бэкендером. При этом никогда не объяснял, почему принимает те или иные решения. Команда чувствовала себя «руками», а не соучастниками.\n\nДвое ушли. Аскар обиделся: «Я же им платил нормально!»\n\nПерелом случился, когда ментор задал ему один вопрос: «А ты хоть раз спросил у них, чего ОНИ хотят от этого проекта?» Аскар начал проводить еженедельные 1-on-1, объяснять бизнес-контекст, делегировать решения. Через 4 месяца команда выросла до 6 человек, и двое пришли по рекомендации тех, кто остался.",
      "task": "Запиши честные ответы на 3 вопроса:\n1. На каком типе авторитета ты сейчас держишься (должность / экспертиза / доверие)?\n2. Вспомни последний раз, когда кто-то не сделал то, что ты просил. Почему это произошло — с ЕГО точки зрения?\n3. Если бы ты нанял человека завтра — смог бы за 5 минут объяснить ему, куда идёт твоя компания и зачем?",
      "keyTakeaway": "Люди идут не за должностью и не за зарплатой. Люди идут за тем, кому доверяют и кто даёт им понять, ЗАЧЕМ они тут."
    },
    {
      "id": 3,
      "block": "Команда",
      "title": "Когда нанимать первого сотрудника",
      "theme": "Урок #3 — БЛОК 3: Команда. Когда нанимать первого сотрудника.",
      "theory": "Главная ошибка — нанимать, когда «завалило работой». К этому моменту ты уже горишь, собеседуешь в панике и берёшь первого попавшегося.\n\n**Правильный момент для найма** — когда ты стабильно отказываешься от заказов или задач, потому что физически не успеваешь, и это длится минимум 2 месяца.\n\n**Кого нанимать первым?** Не того, кто делает то же, что и ты. А того, кто освободит тебе время на то, что приносит деньги. Часто это: проджект-менеджер / ассистент / QA — кто-то, кто снимет с тебя рутину.\n\n**Где искать людей в РК:**\n- hh.kz — классика, но много «мусорных» откликов. Работает для джунов и мидлов.\n- Telegram-чаты: «IT вакансии Казахстан», «Работа в IT Алматы/Астана» — здесь живые люди, быстрый отклик.\n- LinkedIn — для мидлов и синьоров. В РК LinkedIn пока недооценён, но толковые люди там есть.\n- Рекомендации — лучший канал. Спроси у знакомых разработчиков.\n\n**Как проводить собеседование (без HR-отдела):**\n1. 15 мин — расскажи про проект и себя. Честно. Не продавай.\n2. 20 мин — задай 3-4 технических вопроса или дай мини-задачу.\n3. 10 мин — спроси: «Чего ты хочешь через год? Что тебя бесит на текущей работе?» Ответы скажут больше, чем резюме.\n4. Тестовый день/неделя (оплачиваемый!) — обязательно. Бумага терпит всё, а реальная работа — нет.\n\n**ТОО vs ИП — когда переходить:**\n- ИП — ок, пока ты один и оборот до ~10 млн тг/год. Упрощёнка, минимум отчётности.\n- ТОО — нужно, когда: (а) нанимаешь сотрудников официально, (б) работаешь с юрлицами, которым нужен счёт-фактура с НДС, (в) оборот растёт выше порога.\n- В РК открыть ТОО — 1-2 дня через eGov/НАО. Уставный капитал — 0 тенге (нет минимального). Но: бухгалтерия сложнее, нужен бухгалтер (аутсорс — от 30-50 тыс. тг/мес).",
      "case": "Данияр, бэкенд-разработчик из Астаны, фрилансил на Upwork. Когда заказов стало больше, он нанял друга-фронтендера «по-братски» — без договора, без чётких условий. Первый месяц — эйфория. Второй — друг стал задерживать задачи. Третий — Данияр боялся сказать что-то, потому что «ну это же друг». Проект завалили, клиент ушёл.\n\nВторую попытку Данияр сделал иначе: нашёл джуна через Telegram-чат, провёл собеседование, дал оплачиваемую тестовую неделю, заключил договор ГПХ (гражданско-правовой характер). Через 3 месяца открыл ТОО и оформил его в штат. Сейчас в команде 3 человека, проекты идут стабильно.",
      "task": "Составь описание вакансии для первого человека, которого ты бы нанял. Не формальное — а честное:\n- Что конкретно он будет делать каждый день?\n- Какой результат ты от него ждёшь через месяц?\n- Сколько ты реально можешь платить (посмотри рынок на hh.kz)?\nЗапиши это. Даже если нанимать будешь через полгода — у тебя будет готовый портрет.",
      "keyTakeaway": "Первый найм — это не «когда денег будет много». Это когда ты понял, что один ты стоишь дешевле, чем вдвоём. И нанимать нужно не клона себя, а того, кто закроет твои слабые места."
    },
    {
      "id": 4,
      "block": "Бизнес-процессы",
      "title": "От фриланса к компании: структура и процессы",
      "theme": "Урок #4 — БЛОК 4: Бизнес-процессы. От фриланса к компании — как перестать быть человеком-оркестром.",
      "theory": "Фрилансер — это человек, который продаёт своё время. Компания — это система, которая работает и без тебя (хотя бы 2 недели).\n\nРазница — в процессах. Процесс — это ответ на вопрос: «Если меня собьёт автобус, сможет ли кто-то продолжить?»\n\n**3 процесса, которые нужно выстроить первыми:**\n\n1. **Процесс работы с клиентом** — от первого контакта до оплаты. Где фиксируешь заявки? Как считаешь стоимость? Как выставляешь счёт? Если это всё у тебя в голове или в переписке в WhatsApp — это не процесс, это хаос.\n   - Минимум: таблица в Google Sheets или Notion с колонками: клиент / задача / статус / сумма / дедлайн.\n\n2. **Процесс выполнения работы** — как задачи ставятся, отслеживаются, принимаются. Даже если ты один — заведи Trello, Jira, Linear или хотя бы Todoist. Приучай себя к дисциплине ДО того, как появится команда.\n   - Золотое правило: если задачи нет в трекере — её не существует.\n\n3. **Процесс финансов** — куда пришли деньги, куда ушли, сколько осталось. Это был Урок #1, и если ты его сделал — у тебя уже есть база. Если нет — вернись.\n\n**Ловушка «человека-оркестра»:**\nТы кодишь, дизайнишь, продаёшь, ведёшь бухгалтерию, отвечаешь клиентам. Кажется, что экономишь. На самом деле — ты тратишь своё самое дорогое время на задачи стоимостью 2000 тг/час, вместо того чтобы делать то, что стоит 15000 тг/час.\n\n**Правило:** Посчитай, сколько стоит твой час (месячный доход / кол-во рабочих часов). Всё, что можно делегировать дешевле — делегируй. Бухгалтерия, рутинное тестирование, вёрстка писем, контент — это первые кандидаты.\n\n**Инструменты для старта (бесплатные/дешёвые):**\n- Задачи: Trello / Notion / Linear (бесплатно для малых команд)\n- Коммуникация: Telegram (но с отдельным рабочим чатом, не в личке!)\n- Документы: Google Workspace\n- Финансы: Google Sheets (для начала хватит)\n- CRM: Notion или Bitrix24 (бесплатный план)",
      "case": "Мадина из Шымкента — дизайнер, выросла из фриланса в студию. Первые полтора года всё держала в голове: кто что заказал, когда дедлайн, кому выставлен счёт. Работало, пока клиентов было 3-4.\n\nКогда стало 8+ одновременных проектов — начала путать дедлайны, забывать выставлять счета (потеряла ~400 тыс. тг за квартал просто потому, что забыла!), конфликтовать с клиентами из-за «а мы так не договаривались».\n\nПеревернуло всё одно действие: она потратила воскресенье и сделала в Notion шаблон проекта — с этапами, чеклистами, автосчётом часов. Каждый новый проект — копия шаблона. Через месяц наняла помощницу, которая просто вела эти карточки. Мадина перестала заниматься рутиной и взяла ещё 4 проекта. Доход вырос на 60%.",
      "task": "Сделай одну из двух вещей (выбери то, чего у тебя ещё нет):\n\nВариант А: Создай таблицу/доску для текущих проектов. Колонки: Клиент → Задача → Статус (новая / в работе / готово / оплачено) → Сумма → Дедлайн. Внеси туда ВСЕ текущие задачи.\n\nВариант Б: Посчитай стоимость своего часа. Запиши 3 задачи, которые ты делаешь регулярно и которые можно отдать человеку за 1500-3000 тг/час. Прикинь, сколько часов в месяц ты на них тратишь.",
      "keyTakeaway": "Компания отличается от фриланса не размером, а наличием системы. Система — это когда процесс описан, а не живёт у тебя в голове. Начни с одного процесса — и ты уже ближе к компании, чем 90% фрилансеров."
    },
    {
      "id": 5,
      "block": "Финансы",
      "title": "ИП в Казахстане: налоги, режимы, оптимизация",
      "date": "2026-02-14"
    },
    {
      "n": 9,
      "date": "2026-02-15",
      "block": 1,
      "topic": "Юнит-экономика: CAC, LTV, маржа, точка безубыточности, cash flow"
    },
    {
      "n": 10,
      "date": "2026-02-15",
      "block": 1,
      "topic": "Долги: стратегия выхода и антикризисный план"
    },
    {
      "id": 11,
      "date": "2026-02-15",
      "block": "Лидерство",
      "title": "Обратная связь: как говорить неприятное",
      "theme": "Формула SBI, правило 24 часов, обратная связь без конфликта",
      "status": "generated"
    },
    {
      "id": 12,
      "date": "2026-02-15",
      "block": "Команда",
      "title": "Мотивация при бюджете 300К",
      "theme": "Автономия, рост, смысл — три нефинансовых драйвера удержания",
      "status": "generated"
    },
    {
      "id": 13,
      "date": "2026-02-15",
      "block": "Бизнес-процессы",
      "title": "Контракты и защита от кидал",
      "theme": "Договор ГПХ, ТЗ как приложение, акт выполненных работ, предоплата",
      "status": "generated"
    },
    {
      "n": 14,
      "date": "2026-02-16",
      "block": 1,
      "topic": "Подушка безопасности: личная и для бизнеса"
    },
    {
      "n": 15,
      "date": "2026-02-16",
      "block": 2,
      "topic": "Делегирование: как отпустить контроль и не сойти с ума"
    },
    {
      "n": 16,
      "date": "2026-02-16",
      "block": 3,
      "topic": "Онбординг: как не потерять человека в первую неделю"
    },
    {
      "n": 17,
      "date": "2026-02-16",
      "block": 4,
      "topic": "Ценообразование IT-услуг: как перестать продавать себя дёшево"
    },
    {
      "n": 18,
      "date": "2026-02-17",
      "block": 3,
      "topic": "Трудовой кодекс РК: минимум, который спасёт от штрафов"
    },
    {
      "n": 19,
      "date": "2026-02-17",
      "block": 4,
      "topic": "Продажи IT-услуг в РК: где брать клиентов, если ты не продажник"
    },
    {
      "n": 20,
      "date": "2026-02-18",
      "block": 1,
      "topic": "Инвестиции и накопления: как заставить деньги работать"
    },
    {
      "n": 21,
      "date": "2026-02-18",
      "block": 2,
      "topic": "Конфликты: как разруливать, а не убегать"
    },
    {
      "n": 22,
      "date": "2026-02-18",
      "block": 3,
      "topic": "Культура команды: как создать среду, из которой не хотят уходить"
    },
    {
      "n": 23,
      "date": "2026-02-18",
      "block": 4,
      "topic": "Масштабирование: как перейти от 1-2 проектов к 10 и не захлебнуться"
    },
    {
      "n": 24,
      "date": "2026-02-19",
      "block": 1,
      "topic": "Разделение личных и бизнес-финансов: два кошелька — одна голова"
    },
    {
      "n": 25,
      "date": "2026-02-19",
      "block": 2,
      "topic": "Коммуникация: как доносить мысли, если ты интроверт"
    },
    {
      "n": 26,
      "date": "2026-02-19",
      "block": 3,
      "topic": "Собеседование продажника: как не нанять болтуна"
    },
    {
      "n": 27,
      "date": "2026-02-19",
      "block": 4,
      "topic": "Клиентский сервис: как удерживать клиентов и получать повторные заказы"
    },
    {
      "n": 28,
      "date": "2026-02-20",
      "block": 1,
      "topic": "Дебиторская задолженность: как получать деньги вовремя и не финансировать чужой бизнес"
    },
    {
      "n": 29,
      "date": "2026-02-20",
      "block": 2,
      "topic": "Мотивация команды без бюджета: как удерживать людей, когда платишь скромно"
    },
    {
      "n": 30,
      "date": "2026-02-20",
      "block": 3,
      "topic": "KPI для продажника: оклад, бонус, план продаж — как не платить за воздух"
    },
    {
      "n": 31,
      "date": "2026-02-20",
      "block": 4,
      "topic": "Упаковка IT-компании: сайт, портфолио и кейсы, которые продают"
    },
    {
      "n": 32,
      "date": "2026-02-21",
      "block": 1,
      "topic": "Финансирование роста: гранты, кредиты и инвесторы в РК — где взять деньги на масштаб"
    },
    {
      "n": 33,
      "date": "2026-02-21",
      "block": 2,
      "topic": "Типы лидерства: ситуационный подход — когда давить, когда поддерживать, а когда отпустить"
    },
    {
      "n": 34,
      "date": "2026-02-21",
      "block": 3,
      "topic": "ТОО vs ИП при найме: как оформить первого сотрудника без геморроя и лишних налогов"
    },
    {
      "n": 35,
      "date": "2026-02-21",
      "block": 4,
      "topic": "Маркетинг IT-услуг в РК: как тебя находят сами — репутация, контент и входящие заявки без бюджета"
    },
    {
      "n": 36,
      "date": "2026-02-21",
      "block": 1,
      "topic": "Себестоимость IT-проекта: как считать затраты, чтобы не работать в минус"
    },
    {
      "n": 37,
      "date": "2026-02-22",
      "block": 1,
      "topic": "НДС в РК: когда вставать на учёт, как работать и стоит ли бояться порога в 20 000 МРП"
    },
    {
      "n": 38,
      "date": "2026-02-22",
      "block": 2,
      "topic": "Твёрдость без агрессии: как говорить «нет», держать границы и не бояться недовольных"
    },
    {
      "n": 39,
      "date": "2026-02-22",
      "block": 3,
      "topic": "Где искать людей в РК: каналы найма, которые реально работают"
    },
    {
      "n": 40,
      "date": "2026-02-22",
      "block": 4,
      "topic": "Субподряд и партнёрства: как брать проекты выше своих возможностей — и не облажаться"
    },
    {
      "n": 41,
      "date": "2026-02-23",
      "block": 1,
      "topic": "Зарплата собственника: как платить себе законно, правильно и без чувства вины"
    },
    {
      "n": 42,
      "date": "2026-02-23",
      "block": 2,
      "topic": "1-on-1 встречи: как управлять командой через разговор и узнавать о проблемах до пожара"
    }
  ]
}
